README.org
* Twitter to Blog
:PROPERTIES:
:LOGGING: nil
:END:
** Premise
Twitter has so much information hidden in it's threads, but navigating them by topic is somewhat hard.

This is my attempt at using Twitter's API o convert a user's account into a essentially a blog, done with MERN stack

** Plan
*** Steps
**** UI
***** NEXT Main page lists highly engaged tweets in past with user bio, main tweet, keywords
***** TODO Back button to save preferences
***** TODO Search Page with advanced options
***** TODO search threads in author page
***** TODO Beautify
****** author page
******* add more author data
******** followers
******** main topics
******* make thread cards
****** Thread Page
******* Better text formatting and font
***** TODO Reccomendations
**** Data
***** NEXT Auto Update Twitter data
***** NEXT Expand links
***** TODO summarize
***** TODO better keywords
****** NEXT Naval how to get rich no keywords bug
** Other notes
Used [[https://blog.patricktriest.com/text-search-docker-elasticsearch/][this vue and elastic tutorial]] and [[https://blog.logrocket.com/full-text-search-with-node-js-and-elasticsearch-on-docker/][this other tutorial]] to help figure out the MERN stack

For refactoring the app after solidifying my stack, I used [[https://www.section.io/engineering-education/build-and-dockerize-a-full-stack-react-app-with-nodejs-and-nginx/][this]] link. Also, [[https://tiangolo.medium.com/react-in-docker-with-nginx-built-with-multi-stage-docker-builds-including-testing-8cc49d6ec305][this link]] help directly build the app and push into nginx

[[https://github.com/fireship-io/tailwind-dashboard/blob/main/src/index.css][This]] was amazing reference while figuring out tailwind
